grevaillot/svd_tools/headers/STM32F413/dfsdm2.h
#define DFSDM2_CH4AWSCDR_BKSCD_SHIFT		12
#define DFSDM2_CH4AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm2_ch4awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM2_CH4AWSCDR_SCDT_SHIFT		0
#define DFSDM2_CH4AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm2_ch4awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch4wdatr CH4WDATR CHWDAT4R
@{*/


#define DFSDM2_CH4WDATR_WDATA_SHIFT		0
#define DFSDM2_CH4WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm2_ch4wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch4datinr CH4DATINR CHDATIN4R
@{*/


#define DFSDM2_CH4DATINR_INDAT1_SHIFT		16
#define DFSDM2_CH4DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm2_ch4datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM2_CH4DATINR_INDAT0_SHIFT		0
#define DFSDM2_CH4DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm2_ch4datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch5cfgr1 CH5CFGR1 CHCFG5R1
@{*/


#define DFSDM2_CH5CFGR1_DATPACK_SHIFT		14
#define DFSDM2_CH5CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm2_ch5cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM2_CH5CFGR1_DATMPX_SHIFT		12
#define DFSDM2_CH5CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm2_ch5cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM2_CH5CFGR1_CHINSEL CHINSEL **/
#define DFSDM2_CH5CFGR1_CHINSEL		(1 << 8)
/** DFSDM2_CH5CFGR1_CHEN CHEN **/
#define DFSDM2_CH5CFGR1_CHEN		(1 << 7)
/** DFSDM2_CH5CFGR1_CKABEN CKABEN **/
#define DFSDM2_CH5CFGR1_CKABEN		(1 << 6)
/** DFSDM2_CH5CFGR1_SCDEN SCDEN **/
#define DFSDM2_CH5CFGR1_SCDEN		(1 << 5)

#define DFSDM2_CH5CFGR1_SPICKSEL_SHIFT		2
#define DFSDM2_CH5CFGR1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm2_ch5cfgr1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM2_CH5CFGR1_SITP_SHIFT		0
#define DFSDM2_CH5CFGR1_SITP_MASK		0x03
/** @defgroup dfsdm2_ch5cfgr1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch5cfgr2 CH5CFGR2 CHCFG5R2
@{*/


#define DFSDM2_CH5CFGR2_OFFSET_SHIFT		8
#define DFSDM2_CH5CFGR2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm2_ch5cfgr2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM2_CH5CFGR2_DTRBS_SHIFT		3
#define DFSDM2_CH5CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm2_ch5cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch5awscdr CH5AWSCDR AWSCD5R
@{*/


#define DFSDM2_CH5AWSCDR_AWFORD_SHIFT		22
#define DFSDM2_CH5AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm2_ch5awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM2_CH5AWSCDR_AWFOSR_SHIFT		16
#define DFSDM2_CH5AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm2_ch5awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM2_CH5AWSCDR_BKSCD_SHIFT		12
#define DFSDM2_CH5AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm2_ch5awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM2_CH5AWSCDR_SCDT_SHIFT		0
#define DFSDM2_CH5AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm2_ch5awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch5wdatr CH5WDATR CHWDAT5R
@{*/


#define DFSDM2_CH5WDATR_WDATA_SHIFT		0
#define DFSDM2_CH5WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm2_ch5wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch5datinr CH5DATINR CHDATIN5R
@{*/


#define DFSDM2_CH5DATINR_INDAT1_SHIFT		16
#define DFSDM2_CH5DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm2_ch5datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM2_CH5DATINR_INDAT0_SHIFT		0
#define DFSDM2_CH5DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm2_ch5datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch6cfgr1 CH6CFGR1 CHCFG6R1
@{*/


#define DFSDM2_CH6CFGR1_DATPACK_SHIFT		14
#define DFSDM2_CH6CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm2_ch6cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM2_CH6CFGR1_DATMPX_SHIFT		12
#define DFSDM2_CH6CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm2_ch6cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM2_CH6CFGR1_CHINSEL CHINSEL **/
#define DFSDM2_CH6CFGR1_CHINSEL		(1 << 8)
/** DFSDM2_CH6CFGR1_CHEN CHEN **/
#define DFSDM2_CH6CFGR1_CHEN		(1 << 7)
/** DFSDM2_CH6CFGR1_CKABEN CKABEN **/
#define DFSDM2_CH6CFGR1_CKABEN		(1 << 6)
/** DFSDM2_CH6CFGR1_SCDEN SCDEN **/
#define DFSDM2_CH6CFGR1_SCDEN		(1 << 5)

#define DFSDM2_CH6CFGR1_SPICKSEL_SHIFT		2
#define DFSDM2_CH6CFGR1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm2_ch6cfgr1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM2_CH6CFGR1_SITP_SHIFT		0
#define DFSDM2_CH6CFGR1_SITP_MASK		0x03
/** @defgroup dfsdm2_ch6cfgr1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch6cfgr2 CH6CFGR2 CHCFG6R2
@{*/


#define DFSDM2_CH6CFGR2_OFFSET_SHIFT		8
#define DFSDM2_CH6CFGR2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm2_ch6cfgr2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM2_CH6CFGR2_DTRBS_SHIFT		3
#define DFSDM2_CH6CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm2_ch6cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch6awscdr CH6AWSCDR AWSCD6R
@{*/


#define DFSDM2_CH6AWSCDR_AWFORD_SHIFT		22
#define DFSDM2_CH6AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm2_ch6awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM2_CH6AWSCDR_AWFOSR_SHIFT		16
#define DFSDM2_CH6AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm2_ch6awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM2_CH6AWSCDR_BKSCD_SHIFT		12
#define DFSDM2_CH6AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm2_ch6awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM2_CH6AWSCDR_SCDT_SHIFT		0
#define DFSDM2_CH6AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm2_ch6awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch6wdatr CH6WDATR CHWDAT6R
@{*/


#define DFSDM2_CH6WDATR_WDATA_SHIFT		0
#define DFSDM2_CH6WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm2_ch6wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch6datinr CH6DATINR CHDATIN6R
@{*/


#define DFSDM2_CH6DATINR_INDAT1_SHIFT		16
#define DFSDM2_CH6DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm2_ch6datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM2_CH6DATINR_INDAT0_SHIFT		0
#define DFSDM2_CH6DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm2_ch6datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_ch7cfgr1 CH7CFGR1 CHCFG7R1
@{*/


#define DFSDM2_CH7CFGR1_DATPACK_SHIFT		14
#define DFSDM2_CH7CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm2_ch7cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM2_CH7CFGR1_DATMPX_SHIFT		12
#define DFSDM2_CH7CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm2_ch7cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

