grevaillot/svd_tools/headers/STM32F413/dfsdm2.h
/** DFSDM2_FLT0ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM2_FLT0ICR_CLRROVRF		(1 << 3)
/** DFSDM2_FLT0ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM2_FLT0ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm2_flt0jchgr FLT0JCHGR injected channel group selection register
@{*/


#define DFSDM2_FLT0JCHGR_JCHG_SHIFT		0
#define DFSDM2_FLT0JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm2_flt0jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt0fcr FLT0FCR filter control register
@{*/


#define DFSDM2_FLT0FCR_FORD_SHIFT		29
#define DFSDM2_FLT0FCR_FORD_MASK		0x07
/** @defgroup dfsdm2_flt0fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM2_FLT0FCR_FOSR_SHIFT		16
#define DFSDM2_FLT0FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm2_flt0fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM2_FLT0FCR_IOSR_SHIFT		0
#define DFSDM2_FLT0FCR_IOSR_MASK		0xff
/** @defgroup dfsdm2_flt0fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt0jdatar FLT0JDATAR data register for injected group
@{*/


#define DFSDM2_FLT0JDATAR_JDATA_SHIFT		8
#define DFSDM2_FLT0JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm2_flt0jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM2_FLT0JDATAR_JDATACH_SHIFT		0
#define DFSDM2_FLT0JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm2_flt0jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt0rdatar FLT0RDATAR data register for the regular channel
@{*/


#define DFSDM2_FLT0RDATAR_RDATA_SHIFT		8
#define DFSDM2_FLT0RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm2_flt0rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM2_FLT0RDATAR_RPEND Regular channel pending data **/
#define DFSDM2_FLT0RDATAR_RPEND		(1 << 4)

#define DFSDM2_FLT0RDATAR_RDATACH_SHIFT		0
#define DFSDM2_FLT0RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm2_flt0rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt0awhtr FLT0AWHTR analog watchdog high threshold register
@{*/


#define DFSDM2_FLT0AWHTR_AWHT_SHIFT		8
#define DFSDM2_FLT0AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm2_flt0awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM2_FLT0AWHTR_BKAWH_SHIFT		0
#define DFSDM2_FLT0AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm2_flt0awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt0awltr FLT0AWLTR analog watchdog low threshold register
@{*/


#define DFSDM2_FLT0AWLTR_AWLT_SHIFT		8
#define DFSDM2_FLT0AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm2_flt0awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM2_FLT0AWLTR_BKAWL_SHIFT		0
#define DFSDM2_FLT0AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm2_flt0awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt0awsr FLT0AWSR analog watchdog status register
@{*/


#define DFSDM2_FLT0AWSR_AWHTF_SHIFT		8
#define DFSDM2_FLT0AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm2_flt0awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM2_FLT0AWSR_AWLTF_SHIFT		0
#define DFSDM2_FLT0AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm2_flt0awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt0awcfr FLT0AWCFR analog watchdog clear flag register
@{*/


#define DFSDM2_FLT0AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM2_FLT0AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm2_flt0awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM2_FLT0AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM2_FLT0AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm2_flt0awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt0exmax FLT0EXMAX Extremes detector maximum register
@{*/


#define DFSDM2_FLT0EXMAX_EXMAX_SHIFT		8
#define DFSDM2_FLT0EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm2_flt0exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM2_FLT0EXMAX_EXMAXCH_SHIFT		0
#define DFSDM2_FLT0EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm2_flt0exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt0exmin FLT0EXMIN Extremes detector minimum register
@{*/


#define DFSDM2_FLT0EXMIN_EXMIN_SHIFT		8
#define DFSDM2_FLT0EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm2_flt0exmin_exmin EXMIN EXMIN
@{*/
/**@}*/


#define DFSDM2_FLT0EXMIN_EXMINCH_SHIFT		0
#define DFSDM2_FLT0EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm2_flt0exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt0cnvtimr FLT0CNVTIMR conversion timer register
@{*/


#define DFSDM2_FLT0CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM2_FLT0CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm2_flt0cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt1cr1 FLT1CR1 control register 1
@{*/

/** DFSDM2_FLT1CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM2_FLT1CR1_AWFSEL		(1 << 30)
/** DFSDM2_FLT1CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM2_FLT1CR1_FAST		(1 << 29)

#define DFSDM2_FLT1CR1_RCH_SHIFT		24
#define DFSDM2_FLT1CR1_RCH_MASK		0x07
/** @defgroup dfsdm2_flt1cr1_rch RCH Regular channel selection
@{*/
/**@}*/

/** DFSDM2_FLT1CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM2_FLT1CR1_RDMAEN		(1 << 21)
/** DFSDM2_FLT1CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM2_FLT1CR1_RSYNC		(1 << 19)
/** DFSDM2_FLT1CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM2_FLT1CR1_RCONT		(1 << 18)
/** DFSDM2_FLT1CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM2_FLT1CR1_RSWSTART		(1 << 17)

#define DFSDM2_FLT1CR1_JEXTEN_SHIFT		13
#define DFSDM2_FLT1CR1_JEXTEN_MASK		0x03
/** @defgroup dfsdm2_flt1cr1_jexten JEXTEN Trigger enable and trigger edge selection for injected conversions
@{*/
/**@}*/


#define DFSDM2_FLT1CR1_JEXTSEL_SHIFT		8
#define DFSDM2_FLT1CR1_JEXTSEL_MASK		0x07
/** @defgroup dfsdm2_flt1cr1_jextsel JEXTSEL Trigger signal selection for launching injected conversions
@{*/
/**@}*/

