grevaillot/svd_tools/headers/STM32F413/dfsdm2.h
#define DFSDM2_FLT1EXMAX_EXMAX_SHIFT		8
#define DFSDM2_FLT1EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm2_flt1exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM2_FLT1EXMAX_EXMAXCH_SHIFT		0
#define DFSDM2_FLT1EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm2_flt1exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt1exmin FLT1EXMIN Extremes detector minimum register
@{*/


#define DFSDM2_FLT1EXMIN_EXMIN_SHIFT		8
#define DFSDM2_FLT1EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm2_flt1exmin_exmin EXMIN EXMIN
@{*/
/**@}*/


#define DFSDM2_FLT1EXMIN_EXMINCH_SHIFT		0
#define DFSDM2_FLT1EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm2_flt1exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt1cnvtimr FLT1CNVTIMR conversion timer register
@{*/


#define DFSDM2_FLT1CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM2_FLT1CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm2_flt1cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt2cr1 FLT2CR1 control register 1
@{*/

/** DFSDM2_FLT2CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM2_FLT2CR1_AWFSEL		(1 << 30)
/** DFSDM2_FLT2CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM2_FLT2CR1_FAST		(1 << 29)

#define DFSDM2_FLT2CR1_RCH_SHIFT		24
#define DFSDM2_FLT2CR1_RCH_MASK		0x07
/** @defgroup dfsdm2_flt2cr1_rch RCH Regular channel selection
@{*/
/**@}*/

/** DFSDM2_FLT2CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM2_FLT2CR1_RDMAEN		(1 << 21)
/** DFSDM2_FLT2CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM2_FLT2CR1_RSYNC		(1 << 19)
/** DFSDM2_FLT2CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM2_FLT2CR1_RCONT		(1 << 18)
/** DFSDM2_FLT2CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM2_FLT2CR1_RSWSTART		(1 << 17)

#define DFSDM2_FLT2CR1_JEXTEN_SHIFT		13
#define DFSDM2_FLT2CR1_JEXTEN_MASK		0x03
/** @defgroup dfsdm2_flt2cr1_jexten JEXTEN Trigger enable and trigger edge selection for injected conversions
@{*/
/**@}*/


#define DFSDM2_FLT2CR1_JEXTSEL_SHIFT		8
#define DFSDM2_FLT2CR1_JEXTSEL_MASK		0x07
/** @defgroup dfsdm2_flt2cr1_jextsel JEXTSEL Trigger signal selection for launching injected conversions
@{*/
/**@}*/

/** DFSDM2_FLT2CR1_JDMAEN DMA channel enabled to read data for the injected channel group **/
#define DFSDM2_FLT2CR1_JDMAEN		(1 << 5)
/** DFSDM2_FLT2CR1_JSCAN Scanning conversion mode for injected conversions **/
#define DFSDM2_FLT2CR1_JSCAN		(1 << 4)
/** DFSDM2_FLT2CR1_JSYNC Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger **/
#define DFSDM2_FLT2CR1_JSYNC		(1 << 3)
/** DFSDM2_FLT2CR1_JSWSTART Start a conversion of the injected group of channels **/
#define DFSDM2_FLT2CR1_JSWSTART		(1 << 1)
/** DFSDM2_FLT2CR1_DFEN DFSDM enable **/
#define DFSDM2_FLT2CR1_DFEN		(1 << 0)

/**@}*/

/** @defgroup dfsdm2_flt2cr2 FLT2CR2 control register 2
@{*/


#define DFSDM2_FLT2CR2_AWDCH_SHIFT		16
#define DFSDM2_FLT2CR2_AWDCH_MASK		0xff
/** @defgroup dfsdm2_flt2cr2_awdch AWDCH Analog watchdog channel selection
@{*/
/**@}*/


#define DFSDM2_FLT2CR2_EXCH_SHIFT		8
#define DFSDM2_FLT2CR2_EXCH_MASK		0xff
/** @defgroup dfsdm2_flt2cr2_exch EXCH Extremes detector channel selection
@{*/
/**@}*/

/** DFSDM2_FLT2CR2_CKABIE Clock absence interrupt enable **/
#define DFSDM2_FLT2CR2_CKABIE		(1 << 6)
/** DFSDM2_FLT2CR2_SCDIE Short-circuit detector interrupt enable **/
#define DFSDM2_FLT2CR2_SCDIE		(1 << 5)
/** DFSDM2_FLT2CR2_AWDIE Analog watchdog interrupt enable **/
#define DFSDM2_FLT2CR2_AWDIE		(1 << 4)
/** DFSDM2_FLT2CR2_ROVRIE Regular data overrun interrupt enable **/
#define DFSDM2_FLT2CR2_ROVRIE		(1 << 3)
/** DFSDM2_FLT2CR2_JOVRIE Injected data overrun interrupt enable **/
#define DFSDM2_FLT2CR2_JOVRIE		(1 << 2)
/** DFSDM2_FLT2CR2_REOCIE Regular end of conversion interrupt enable **/
#define DFSDM2_FLT2CR2_REOCIE		(1 << 1)
/** DFSDM2_FLT2CR2_JEOCIE Injected end of conversion interrupt enable **/
#define DFSDM2_FLT2CR2_JEOCIE		(1 << 0)

/**@}*/

/** @defgroup dfsdm2_flt2isr FLT2ISR interrupt and status register
@{*/


#define DFSDM2_FLT2ISR_SCDF_SHIFT		24
#define DFSDM2_FLT2ISR_SCDF_MASK		0xff
/** @defgroup dfsdm2_flt2isr_scdf SCDF short-circuit detector flag
@{*/
/**@}*/


#define DFSDM2_FLT2ISR_CKABF_SHIFT		16
#define DFSDM2_FLT2ISR_CKABF_MASK		0xff
/** @defgroup dfsdm2_flt2isr_ckabf CKABF Clock absence flag
@{*/
/**@}*/

/** DFSDM2_FLT2ISR_RCIP Regular conversion in progress status **/
#define DFSDM2_FLT2ISR_RCIP		(1 << 14)
/** DFSDM2_FLT2ISR_JCIP Injected conversion in progress status **/
#define DFSDM2_FLT2ISR_JCIP		(1 << 13)
/** DFSDM2_FLT2ISR_AWDF Analog watchdog **/
#define DFSDM2_FLT2ISR_AWDF		(1 << 4)
/** DFSDM2_FLT2ISR_ROVRF Regular conversion overrun flag **/
#define DFSDM2_FLT2ISR_ROVRF		(1 << 3)
/** DFSDM2_FLT2ISR_JOVRF Injected conversion overrun flag **/
#define DFSDM2_FLT2ISR_JOVRF		(1 << 2)
/** DFSDM2_FLT2ISR_REOCF End of regular conversion flag **/
#define DFSDM2_FLT2ISR_REOCF		(1 << 1)
/** DFSDM2_FLT2ISR_JEOCF End of injected conversion flag **/
#define DFSDM2_FLT2ISR_JEOCF		(1 << 0)

/**@}*/

/** @defgroup dfsdm2_flt2icr FLT2ICR interrupt flag clear register
@{*/


#define DFSDM2_FLT2ICR_CLRSCDF_SHIFT		24
#define DFSDM2_FLT2ICR_CLRSCDF_MASK		0xff
/** @defgroup dfsdm2_flt2icr_clrscdf CLRSCDF Clear the short-circuit detector flag
@{*/
/**@}*/


#define DFSDM2_FLT2ICR_CLRCKABF_SHIFT		16
#define DFSDM2_FLT2ICR_CLRCKABF_MASK		0xff
/** @defgroup dfsdm2_flt2icr_clrckabf CLRCKABF Clear the clock absence flag
@{*/
/**@}*/

/** DFSDM2_FLT2ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM2_FLT2ICR_CLRROVRF		(1 << 3)
/** DFSDM2_FLT2ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM2_FLT2ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm2_flt2jchgr FLT2JCHGR injected channel group selection register
@{*/


#define DFSDM2_FLT2JCHGR_JCHG_SHIFT		0
#define DFSDM2_FLT2JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm2_flt2jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt2fcr FLT2FCR filter control register
@{*/


