grevaillot/svd_tools/headers/STM32F413/dfsdm2.h
#define DFSDM2_FLT2FCR_FORD_SHIFT		29
#define DFSDM2_FLT2FCR_FORD_MASK		0x07
/** @defgroup dfsdm2_flt2fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM2_FLT2FCR_FOSR_SHIFT		16
#define DFSDM2_FLT2FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm2_flt2fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM2_FLT2FCR_IOSR_SHIFT		0
#define DFSDM2_FLT2FCR_IOSR_MASK		0xff
/** @defgroup dfsdm2_flt2fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt2jdatar FLT2JDATAR data register for injected group
@{*/


#define DFSDM2_FLT2JDATAR_JDATA_SHIFT		8
#define DFSDM2_FLT2JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm2_flt2jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM2_FLT2JDATAR_JDATACH_SHIFT		0
#define DFSDM2_FLT2JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm2_flt2jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt2rdatar FLT2RDATAR data register for the regular channel
@{*/


#define DFSDM2_FLT2RDATAR_RDATA_SHIFT		8
#define DFSDM2_FLT2RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm2_flt2rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM2_FLT2RDATAR_RPEND Regular channel pending data **/
#define DFSDM2_FLT2RDATAR_RPEND		(1 << 4)

#define DFSDM2_FLT2RDATAR_RDATACH_SHIFT		0
#define DFSDM2_FLT2RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm2_flt2rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt2awhtr FLT2AWHTR analog watchdog high threshold register
@{*/


#define DFSDM2_FLT2AWHTR_AWHT_SHIFT		8
#define DFSDM2_FLT2AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm2_flt2awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM2_FLT2AWHTR_BKAWH_SHIFT		0
#define DFSDM2_FLT2AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm2_flt2awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt2awltr FLT2AWLTR analog watchdog low threshold register
@{*/


#define DFSDM2_FLT2AWLTR_AWLT_SHIFT		8
#define DFSDM2_FLT2AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm2_flt2awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM2_FLT2AWLTR_BKAWL_SHIFT		0
#define DFSDM2_FLT2AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm2_flt2awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt2awsr FLT2AWSR analog watchdog status register
@{*/


#define DFSDM2_FLT2AWSR_AWHTF_SHIFT		8
#define DFSDM2_FLT2AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm2_flt2awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM2_FLT2AWSR_AWLTF_SHIFT		0
#define DFSDM2_FLT2AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm2_flt2awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt2awcfr FLT2AWCFR analog watchdog clear flag register
@{*/


#define DFSDM2_FLT2AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM2_FLT2AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm2_flt2awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM2_FLT2AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM2_FLT2AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm2_flt2awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt2exmax FLT2EXMAX Extremes detector maximum register
@{*/


#define DFSDM2_FLT2EXMAX_EXMAX_SHIFT		8
#define DFSDM2_FLT2EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm2_flt2exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM2_FLT2EXMAX_EXMAXCH_SHIFT		0
#define DFSDM2_FLT2EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm2_flt2exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt2exmin FLT2EXMIN Extremes detector minimum register
@{*/


#define DFSDM2_FLT2EXMIN_EXMIN_SHIFT		8
#define DFSDM2_FLT2EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm2_flt2exmin_exmin EXMIN EXMIN
@{*/
/**@}*/


#define DFSDM2_FLT2EXMIN_EXMINCH_SHIFT		0
#define DFSDM2_FLT2EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm2_flt2exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt2cnvtimr FLT2CNVTIMR conversion timer register
@{*/


#define DFSDM2_FLT2CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM2_FLT2CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm2_flt2cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt3cr1 FLT3CR1 control register 1
@{*/

/** DFSDM2_FLT3CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM2_FLT3CR1_AWFSEL		(1 << 30)
/** DFSDM2_FLT3CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM2_FLT3CR1_FAST		(1 << 29)

#define DFSDM2_FLT3CR1_RCH_SHIFT		24
#define DFSDM2_FLT3CR1_RCH_MASK		0x07
/** @defgroup dfsdm2_flt3cr1_rch RCH Regular channel selection
@{*/
/**@}*/

/** DFSDM2_FLT3CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM2_FLT3CR1_RDMAEN		(1 << 21)
/** DFSDM2_FLT3CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM2_FLT3CR1_RSYNC		(1 << 19)
/** DFSDM2_FLT3CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM2_FLT3CR1_RCONT		(1 << 18)
/** DFSDM2_FLT3CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM2_FLT3CR1_RSWSTART		(1 << 17)

#define DFSDM2_FLT3CR1_JEXTEN_SHIFT		13
#define DFSDM2_FLT3CR1_JEXTEN_MASK		0x03
/** @defgroup dfsdm2_flt3cr1_jexten JEXTEN Trigger enable and trigger edge selection for injected conversions
@{*/
/**@}*/


#define DFSDM2_FLT3CR1_JEXTSEL_SHIFT		8
#define DFSDM2_FLT3CR1_JEXTSEL_MASK		0x07
/** @defgroup dfsdm2_flt3cr1_jextsel JEXTSEL Trigger signal selection for launching injected conversions
@{*/
/**@}*/

/** DFSDM2_FLT3CR1_JDMAEN DMA channel enabled to read data for the injected channel group **/
#define DFSDM2_FLT3CR1_JDMAEN		(1 << 5)
/** DFSDM2_FLT3CR1_JSCAN Scanning conversion mode for injected conversions **/
#define DFSDM2_FLT3CR1_JSCAN		(1 << 4)
/** DFSDM2_FLT3CR1_JSYNC Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger **/
#define DFSDM2_FLT3CR1_JSYNC		(1 << 3)
/** DFSDM2_FLT3CR1_JSWSTART Start a conversion of the injected group of channels **/
#define DFSDM2_FLT3CR1_JSWSTART		(1 << 1)
/** DFSDM2_FLT3CR1_DFEN DFSDM enable **/
#define DFSDM2_FLT3CR1_DFEN		(1 << 0)

/**@}*/

/** @defgroup dfsdm2_flt3cr2 FLT3CR2 control register 2
@{*/


