grevaillot/svd_tools/headers/STM32F413/dfsdm2.h
#define DFSDM2_FLT3CR2_AWDCH_SHIFT		16
#define DFSDM2_FLT3CR2_AWDCH_MASK		0xff
/** @defgroup dfsdm2_flt3cr2_awdch AWDCH Analog watchdog channel selection
@{*/
/**@}*/


#define DFSDM2_FLT3CR2_EXCH_SHIFT		8
#define DFSDM2_FLT3CR2_EXCH_MASK		0xff
/** @defgroup dfsdm2_flt3cr2_exch EXCH Extremes detector channel selection
@{*/
/**@}*/

/** DFSDM2_FLT3CR2_CKABIE Clock absence interrupt enable **/
#define DFSDM2_FLT3CR2_CKABIE		(1 << 6)
/** DFSDM2_FLT3CR2_SCDIE Short-circuit detector interrupt enable **/
#define DFSDM2_FLT3CR2_SCDIE		(1 << 5)
/** DFSDM2_FLT3CR2_AWDIE Analog watchdog interrupt enable **/
#define DFSDM2_FLT3CR2_AWDIE		(1 << 4)
/** DFSDM2_FLT3CR2_ROVRIE Regular data overrun interrupt enable **/
#define DFSDM2_FLT3CR2_ROVRIE		(1 << 3)
/** DFSDM2_FLT3CR2_JOVRIE Injected data overrun interrupt enable **/
#define DFSDM2_FLT3CR2_JOVRIE		(1 << 2)
/** DFSDM2_FLT3CR2_REOCIE Regular end of conversion interrupt enable **/
#define DFSDM2_FLT3CR2_REOCIE		(1 << 1)
/** DFSDM2_FLT3CR2_JEOCIE Injected end of conversion interrupt enable **/
#define DFSDM2_FLT3CR2_JEOCIE		(1 << 0)

/**@}*/

/** @defgroup dfsdm2_flt3isr FLT3ISR interrupt and status register
@{*/


#define DFSDM2_FLT3ISR_SCDF_SHIFT		24
#define DFSDM2_FLT3ISR_SCDF_MASK		0xff
/** @defgroup dfsdm2_flt3isr_scdf SCDF short-circuit detector flag
@{*/
/**@}*/


#define DFSDM2_FLT3ISR_CKABF_SHIFT		16
#define DFSDM2_FLT3ISR_CKABF_MASK		0xff
/** @defgroup dfsdm2_flt3isr_ckabf CKABF Clock absence flag
@{*/
/**@}*/

/** DFSDM2_FLT3ISR_RCIP Regular conversion in progress status **/
#define DFSDM2_FLT3ISR_RCIP		(1 << 14)
/** DFSDM2_FLT3ISR_JCIP Injected conversion in progress status **/
#define DFSDM2_FLT3ISR_JCIP		(1 << 13)
/** DFSDM2_FLT3ISR_AWDF Analog watchdog **/
#define DFSDM2_FLT3ISR_AWDF		(1 << 4)
/** DFSDM2_FLT3ISR_ROVRF Regular conversion overrun flag **/
#define DFSDM2_FLT3ISR_ROVRF		(1 << 3)
/** DFSDM2_FLT3ISR_JOVRF Injected conversion overrun flag **/
#define DFSDM2_FLT3ISR_JOVRF		(1 << 2)
/** DFSDM2_FLT3ISR_REOCF End of regular conversion flag **/
#define DFSDM2_FLT3ISR_REOCF		(1 << 1)
/** DFSDM2_FLT3ISR_JEOCF End of injected conversion flag **/
#define DFSDM2_FLT3ISR_JEOCF		(1 << 0)

/**@}*/

/** @defgroup dfsdm2_flt3icr FLT3ICR interrupt flag clear register
@{*/


#define DFSDM2_FLT3ICR_CLRSCDF_SHIFT		24
#define DFSDM2_FLT3ICR_CLRSCDF_MASK		0xff
/** @defgroup dfsdm2_flt3icr_clrscdf CLRSCDF Clear the short-circuit detector flag
@{*/
/**@}*/


#define DFSDM2_FLT3ICR_CLRCKABF_SHIFT		16
#define DFSDM2_FLT3ICR_CLRCKABF_MASK		0xff
/** @defgroup dfsdm2_flt3icr_clrckabf CLRCKABF Clear the clock absence flag
@{*/
/**@}*/

/** DFSDM2_FLT3ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM2_FLT3ICR_CLRROVRF		(1 << 3)
/** DFSDM2_FLT3ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM2_FLT3ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm2_flt3jchgr FLT3JCHGR injected channel group selection register
@{*/


#define DFSDM2_FLT3JCHGR_JCHG_SHIFT		0
#define DFSDM2_FLT3JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm2_flt3jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt3fcr FLT3FCR filter control register
@{*/


#define DFSDM2_FLT3FCR_FORD_SHIFT		29
#define DFSDM2_FLT3FCR_FORD_MASK		0x07
/** @defgroup dfsdm2_flt3fcr_ford FORD Sinc filter order
@{*/
/**@}*/


#define DFSDM2_FLT3FCR_FOSR_SHIFT		16
#define DFSDM2_FLT3FCR_FOSR_MASK		0x3ff
/** @defgroup dfsdm2_flt3fcr_fosr FOSR Sinc filter oversampling ratio (decimation rate)
@{*/
/**@}*/


#define DFSDM2_FLT3FCR_IOSR_SHIFT		0
#define DFSDM2_FLT3FCR_IOSR_MASK		0xff
/** @defgroup dfsdm2_flt3fcr_iosr IOSR Integrator oversampling ratio (averaging length)
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt3jdatar FLT3JDATAR data register for injected group
@{*/


#define DFSDM2_FLT3JDATAR_JDATA_SHIFT		8
#define DFSDM2_FLT3JDATAR_JDATA_MASK		0xffffff
/** @defgroup dfsdm2_flt3jdatar_jdata JDATA Injected group conversion data
@{*/
/**@}*/


#define DFSDM2_FLT3JDATAR_JDATACH_SHIFT		0
#define DFSDM2_FLT3JDATAR_JDATACH_MASK		0x07
/** @defgroup dfsdm2_flt3jdatar_jdatach JDATACH Injected channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt3rdatar FLT3RDATAR data register for the regular channel
@{*/


#define DFSDM2_FLT3RDATAR_RDATA_SHIFT		8
#define DFSDM2_FLT3RDATAR_RDATA_MASK		0xffffff
/** @defgroup dfsdm2_flt3rdatar_rdata RDATA Regular channel conversion data
@{*/
/**@}*/

/** DFSDM2_FLT3RDATAR_RPEND Regular channel pending data **/
#define DFSDM2_FLT3RDATAR_RPEND		(1 << 4)

#define DFSDM2_FLT3RDATAR_RDATACH_SHIFT		0
#define DFSDM2_FLT3RDATAR_RDATACH_MASK		0x07
/** @defgroup dfsdm2_flt3rdatar_rdatach RDATACH Regular channel most recently converted
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt3awhtr FLT3AWHTR analog watchdog high threshold register
@{*/


#define DFSDM2_FLT3AWHTR_AWHT_SHIFT		8
#define DFSDM2_FLT3AWHTR_AWHT_MASK		0xffffff
/** @defgroup dfsdm2_flt3awhtr_awht AWHT Analog watchdog high threshold
@{*/
/**@}*/


#define DFSDM2_FLT3AWHTR_BKAWH_SHIFT		0
#define DFSDM2_FLT3AWHTR_BKAWH_MASK		0x0f
/** @defgroup dfsdm2_flt3awhtr_bkawh BKAWH Break signal assignment to analog watchdog high threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt3awltr FLT3AWLTR analog watchdog low threshold register
@{*/


#define DFSDM2_FLT3AWLTR_AWLT_SHIFT		8
#define DFSDM2_FLT3AWLTR_AWLT_MASK		0xffffff
/** @defgroup dfsdm2_flt3awltr_awlt AWLT Analog watchdog low threshold
@{*/
/**@}*/


#define DFSDM2_FLT3AWLTR_BKAWL_SHIFT		0
#define DFSDM2_FLT3AWLTR_BKAWL_MASK		0x0f
/** @defgroup dfsdm2_flt3awltr_bkawl BKAWL Break signal assignment to analog watchdog low threshold event
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt3awsr FLT3AWSR analog watchdog status register
@{*/


#define DFSDM2_FLT3AWSR_AWHTF_SHIFT		8
#define DFSDM2_FLT3AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm2_flt3awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM2_FLT3AWSR_AWLTF_SHIFT		0
#define DFSDM2_FLT3AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm2_flt3awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm2_flt3awcfr FLT3AWCFR analog watchdog clear flag register
@{*/


